'''

1) Интегрировать все тесткейсы
2) оптимизировать алгоритм через перепривязку деревьев (в finde)
    7->6->4->1
    на всех этих индексах должны стать значения 1
3) 16 папка сделать

'''
case_1 = {'input': [[6, 3, 2], [[1, 2], [3, 2], [6, 4]], [[6, 1], [3, 1]]],
        'expected_output': 0}

cases = [case_1]
# cases = [cases_1, cases_2, cases_3, cases_4]
# Sample Input 1:
# 4 6 0
# 1 2
# 1 3
# 1 4
# 2 3
# 2 4
# 3 4
#
# Sample Output 1:
# 1
#
# Sample Input 2:
# 4 6 1
# 1 2
# 1 3
# 1 4
# 2 3
# 2 4
# 3 4
# 1 2
#
# Sample Output 2:
# 0
#
# Sample Input 3:
# 4 0 6
# 1 2
# 1 3
# 1 4
# 2 3
# 2 4
# 3 4
#
# Sample Output 3:
# 1