'''
    [В ответ на Денис Дубовитский]
    А что про генераторы они тебя спрашивали?

    Денис Дубовитский, [07.12.18 11:59]
    Ну типа "запили функцию, которая генерит последовательность, не занимая память"


    Денис Дубовитский, [07.12.18 11:59]
    Ну или покомпонентное произведение сжатых векторов

    Денис Дубовитский, [07.12.18 11:59]
    сумма покомпонентных произведений то есть
    разжимать эти вектора нельзя
'''

# [1,1,1,1,5,5,5,7,7]
# [2,4,4,4,8,8,0,0,0]
# [2,4,4,4,40,40,0,0,0] - произведения
#  94 - сумма произведений


[1,1,1,1,5,5,5,7,7]
[2,4,4,4,8,8,0,0,0]